# AddEdge Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Form..::..AddEdge Method
Form Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddEdge(Reference, Reference) | Add an edge to the form, connecting two edges on same/different profile, by a pair of specified points. |
| AddEdge(Reference, XYZ) | Add an edge to the form, connecting two edges on different profiles, by a specified face of the form and a point on face. |
| AddEdge(Reference, Double, Reference, Double) | Add an edge to the form, connecting two edges on same/different profile, by a pair of specified edge/param. |

# See Also
Form Class
Form Members
Autodesk.Revit.DB Namespace